#----------------------------#
# Lars De Richter’s Brewfile #
#----------------------------#


#####################
#     Utilities     #
#####################

tap "homebrew/core"

# System utilities
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed", args: ["with-default-names"]
brew "gpg"
brew "bash"
brew "bash-completion@2"
brew "z"

# Other utilities
brew "git"
brew "git-lfs"
brew "git-extras"
brew "git-flow"

# Media
brew "libdvdcss"

# Nodejs
brew "nvm"

# Ruby
brew "chruby"
brew "ruby-install"


##################################
#     3rd Party Applications     #
##################################

cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-eid"
tap "buo/cask-upgrade"
tap "lars-derichter/mycasks"

# System apps
cask "appcleaner"
cask "burn"
cask "ccleaner"
cask "cheatsheet"
cask "dropbox"
cask "duet"
cask "eid-be"
cask "eid-be-viewer"
cask "filezilla"
cask "iterm2"
cask "nordvpn"
cask "transmission"
cask "tripmode"
cask "viscosity"

# NTFS (order is important)
cask "osxfuse"
brew "ntfs-3g"

# Browsers
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "google-chrome-canary"

# Productivity
cask "alfred"
cask "atext"
cask "focus"
cask "hazel"
cask "itsycal"
cask "keyboard-maestro"
cask "microsoft-office"
cask "rescuetime"
cask "spectacle"
cask "toggl"

# Developer apps
cask "atom"
#cask "colorschemer-studio"
cask "cyberduck"
cask "dash"
cask "github"
cask "imageoptim"
cask "mamp"
cask "parallels"
cask "postman"
cask "virtualbox"
cask "visual-studio-code"

# Communication
cask "skype"
cask "skype-for-business"
cask "slack"

# Writing
cask "scrivener"

# Media apps
cask "adobe-digital-editions"
#cask "audacity" # install manually
cask "calibre"
cask "camtasia-3" # my own version 3 of camtasia (without watermarks)
cask "clipgrab"
cask "figma"
cask "handbrake"
cask "kindle"
cask "kobo"
cask "lastfm"
cask "send-to-kindle"
cask "sketch"
cask "spotify"
cask "simple-comic"
cask "vlc"

# Gaming
cask "gog-galaxy"
cask "steam"

# fonts
cask font-chelsea-market
cask font-montserrat
cask font-open-sans
cask font raleway
cask font-source-code-pro
cask font-ubuntu
cask font-vt323



########################
#    Appstore apps     #
########################

# System apps
mas "1Password", id: 443987910
mas "Amphetamine", id: 937984704
mas "Boom 2", id: 948176063
mas "DaisyDisk", id: 411643860
mas "FruitJuice", id: 671736912
mas "Logitech Camera Settings", id: 638332853
mas "Microsoft Remote Desktop", id: 1295203466
mas "OneDrive", id: 823766827
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353

# Communication
mas "WhatsApp", id: 1147396723

# Productivity
mas "Bear", id: 1091189122
mas "Deckset", id: 847496013
mas "Evernote", id: 406056744
mas "Keynote", id: 409183694
mas "KyPass", id: 555293879
mas "MindNode", id: 992076693
mas "Pages", id: 409201541
mas "PopClip", id: 445189367
mas "Scapple", id: 568020055
mas "Skitch", id: 425955336
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
mas "Type Fu", id: 509818877

# Developer apps
mas "JSON Helper for AppleScript", id: 453114608

# Writing
mas "Byword", id: 420212497
mas "Day One", id: 1055511498
mas "OmmWriter", id: 412347921
mas "Rough Draft", id: 1021874663
mas "Quiver - take better notes", id: 866773894

# Media apps
mas "Acorn", id: 634108295
mas "Comic Life 3", id: 688953417
mas "iMovie", id: 408981434
mas "Pixelmator", id: 407963104
mas "Screenium 3", id: 921553264
